{
    "image_text_pairs": [
        {
            "text": "This is a red apple.",
            "label": "The best gripper for this object is Suction Gripper because it is suitable for soft, round objects like apples and can create a vacuum seal."
        },
        {
            "text": "This is a cardboard box.",
            "label": "The best gripper for this object is Parallel Jaw Gripper because it is ideal for flat and rigid objects like boxes and can securely grasp them."
        },
        {
            "text": "This is a steel rod.",
            "label": "The best gripper for this object is Magnetic Gripper because the object is metallic, making a magnetic gripper the best choice for lifting it."
        },
        {
            "text": "This is a red apple.",
            "label": "The best gripper for this object is Suction Gripper because suction grippers work well on smooth, curved surfaces by generating a strong vacuum grip."
        },
        {
            "text": "This is a wooden box.",
            "label": "The best gripper for this object is Parallel Jaw Gripper because this gripper is effective for rigid and flat objects like wooden boxes, securely clamping onto the edges."
        },
        {
            "text": "This is a metal pipe.",
            "label": "The best gripper for this object is Magnetic Gripper because the metal pipe is made of steel, making it ideal for lifting with a magnetic gripper."
        },
        {
            "text": "This is a plastic bottle.",
            "label": "The best gripper for this object is Suction Gripper because suction grippers work well on smooth surfaces like plastic bottles, ensuring a firm hold."
        },
        {
            "text": "This is a stack of paper sheets.",
            "label": "The best gripper for this object is Parallel Jaw Gripper because this gripper can hold thin and flat objects like paper stacks securely without damaging them."
        },
        {
            "text": "This is a small iron rod.",
            "label": "The best gripper for this object is Magnetic Gripper because the object is small, metallic, and responds to a magnet, making a magnetic gripper the best option."
        },
        {
            "text": "This is a soft foam ball.",
            "label": "The best gripper for this object is Suction Gripper because foam balls are lightweight and soft, and suction grippers can provide a gentle yet firm hold."
        }
    ]
}
